export default ["Method of Interconnection",
"Location of Interconnection",
"Primary Service Breaker Size",
"Primary Service Main Busbar Rating",
"Subpanel Busbar Rating",
"Subpanel Breaker Size (current feeding the subpanel busbar)",
"What is the sum of the rated AC output current from inverter(s) X 1.25?",
"Is the PV system AC output overcurrent device properly sized? NEC 705.12",
"Is the PV system overcurrent protection installed in the correct location within the panelboard? NEC 705.12(D)(2)(3)(a)",
"The ampere rating of the overcurrent device protecting the panelboard busbar, plus 125% of the inverter output current ratings must not exceed 120% of the", "ampere rating of the panelboard busbar. NEC 690.8(3), 705.12(D)(2)(3)(b)",
"Where the PV system is connected to the supply side of the service disconnecting means, the sum of the ratings of the inverter AC overcurrent protection", "device(s) must not exceed the rating of the utility service. NEC 705.12(A)",
"Where the PV system is connected to the supply side of the service disconnecting means, overcurrent protection for the PV system is located within 10ft of the", "Point of Interconnection. NEC 705.31",
"In the event of a supply side connection, are the enclosure and system conductors properly rated for a minimum of 60A?",
"PV system monitor installed? (yes results in drop down to record MAC ID, ID number, etc)",
"PV System Monitor type?",
"Attach Photo of Point of Interconnection showing components used.",
"Comments",
"Type of inverter technology used?",
"Number of inverters?",
"Inverter 1- Manufacturer",
"Inverter 1 Model",
"Inverter 1 Output (Wac)",
"Number of strings to inverter? Number of micro-inverters in branch circuit?",
"Overcurrent protection rating (A)",
"Inverter 2- Manufacturer",
"Inverter 2 Model",
"Inverter 2 Output (Wac)",
"Number of strings to inverter? Number of micro-inverters in branch circuit?",
"Overcurrent protection rating (A)",
"Inverter 3- Manufacturer",
"Inverter 3 Model",
"Inverter 3 Output (Wac)",
"Number of strings to inverter? Number of micro-inverters in branch circuit?",
"Overcurrent protection rating (A)",
"Inverter 4- Manufacturer",
"Inverter 4 Model",
"Inverter 4 Output (Wac)",
"Number of strings to inverter? Number of micro-inverters in branch circuit?",
"Overcurrent protection rating (A)",
"DC Optimizer Manufacturer",
,
"DC Optimizer Model",
"Is Branch Circuit or Inverter OCPD properly sized as required by NEC and/or manufacturers recommendations? NEC 690.8(A) , 240.6",
"Is inverter equipment UL listed for use? IBC 1505.9",
"Is the inverter operating?",
"Is the inverter mounted to the manufacturer specifications with a minimum of 3’ workspace clearance? NEC 110.26(A)",
"Inverter Location",
"Attach Photo of Inverter Showing Installation Location",
"Comments",
"System Output (kW)",
"Total Number of Modules",
"Manufacturer",
"Model",
"Module Output (Wdc @ STC)",
"Number of Arrays",
"Array 1– Number of Modules",
"Array 1 – Tilt",
"Array 1 – Azimuth",
"Array 1 – Location",
"Array 2 – Number of Modules",
"Array 2 – Tilt",
"Array 2 – Azimuth",
"Array 2 – Location",
"Array 3– Number of Modules",
"Array 3 – Tilt",
"Array 3 – Azimuth",
"Array 3 – Location",
"Array 4– Number of Modules",
"Array 4 – Tilt",
"Array 4 – Azimuth",
"Array 4 – Location",
"Are modules UL listed for use? IBC 1505.9",
"Are modules spaced according to manufacturer’s recommendations?",
"TotalNumber of Strings or Branch Circuits in System?",
"Height from the roof surface to the bottom of the module frame (in.)",
"Tilt andAzimuth measured by?",
"Attach Photo of Overall Array",
"Comments",
"Are standard building conductors used and was appropriate care taken when wiring or completing terminations? NEC 110.14(A), 690.31",
"Are conductors on the rooftop properly sized and rated for 90 degrees C and wet service: THWN-2, THHW, THW, RHW, XHHW, or ZW? NEC 310.15",
"Do PV Source Circuit free-air conductors have 900 C, sunlight, and wet service ratings? Single-conductor cable type specifically listed and labeled PV-Wire", "required for use in ungrounded systems. Grounded systems may use USE-2 or PV wire. NEC 690.31(D)",
"Nonmetallic-sheathed conductors and cables are secured within 12 inches of each box, cabinet, conduit body or other termination? NEC 334.30",
"Are splices suitable for the location in which they are made? Wet- location wire nuts shall be used even when installed in a waterproof junction box. NEC 11",0.14"(B)",
"Are disconnects rated for their locations and properly installed? NEC 690 section III, 705.22",
"Are disconnects located such that fuses can be isolated for service, where applicable? NEC 690.16",
"Are module connectors rated for use and are connections properly made? NEC 690.32, 690.33",
"Is a strain relief fitting appropriate for the installation at the junction box or the transition into conduit? NEC 300.16(B)",
"Where DC PV source circuits are run on or inside a building, they are in metal conduit from the point of penetration into the building to the first accessible", "disconnect. NEC 690.31(G)",
"Are system conductors kept from being readily accessible? NEC 690.31(A)",
"Are any conductors exposed to direct UV?",
"Are all zip ties and wire ties rated for use with exposure to UV?",
"Are any dissimilar metals being combined? NEC 110.14",
"Are conductors loose or not properly managed beneath the array? NEC 110.7",
"Are Conductors touching roof surface or in contact with sharp or abrasive surfaces? NEC 300.4, 334",
"Conductor bend radius: The radius of the curve of the inner edge of any bend during or after installation shall not be less than five times the diameter of, the" "cable. NEC 334.24",
"Junction, pull, and outlet boxes are installed so that the wiring contained in them can be rendered accessible directly or by displacement of components", "secured by removable fasteners and connected by a flexible wiring system. NEC 690.34",
"Does the system have arc fault protection? NEC 690.11",
"Does the system have a disconnecting means located in a readily accessible location either on the outside of a structure or inside nearest the point of", "entrance of the system conductors? NEC 690.13(A)",
"Does the system provide rapid shutdown capability? NEC 690.12",
"Are conductors clearly marked? Grounded conductors are white or gray at each end and everywhere the conductor is accessible. NEC 200.6, 210.5, 310.110",
"Are all metal parts of raceways, cables, enclosures and equipment properly connected to the main supply source, and to earth via an effective ground-fault", "current path to a grounding electrode? NEC 250.4(A), 250.24, 250.64, 250.166, 690.43, 690.47",
"Is(Are) grounding conductor(s) properly sized for use? NEC 250.122, Table 250.122",
"Are grounding conductors properly identified? (green, bare, or green with yellow stripes) NEC 250.119",
"Is(Are) grounding conductor(s) properly grouped together in the same raceway, cable or cable tray? NEC 300.3(B), 300.5(I), 300.20(A), 690.43(F)",
"Is DC grounding electrode conductor a minimum of 8 AWG? NEC 250.166(B)",
"Is(Are) the grounding conductor(s) 8AWG or smaller protected within conduit? NEC 250.64(B)",
"All grounding conductor attachments are made with approved methods of termination? NEC 250.8",
"Are modules electrically grounded in accordance with module and racking (integrated grounding) manufacturer's installation instructions? NEC 690.43(D)",
"Additional Electrical Concerns or Code Violations",
"Comments",
"Are modules and racking equipment mounted securely, neatly, and level? NEC 110.12, 110.13",
"All junction boxes, combiners, or switchgear are listed, rated for exterior application, and securely installed? NEC 110.3, 110.12, 110.13, 300.6",
"Are there any objects or hardware in contact with module backsheet?",
"Any sign of damage to modules or system components? NEC 110.12",
"Are modules installed over top of any mechanical or plumbing vents? IRC P3103.1",
"Is conduit rated for its location, with supports properly spaced for the size and type of conduit? NEC 352, 350.22, 358",
"Are conduit supports rated for use and properly installed? NEC 110.13",
"Is module racking installed to manufacturers’ specifications? IBC 1505.9",
"Are footings, support structure, and all penetrations sufficiently flashed and waterproofed? IBC R903, R905.2.8",
"All conduit transitions to conditioned space properly sealed with exterior grade sealant? NEC 300.7",
"Where applicable, ballast type support systems are properly installed where roof pitch does not exceed one (1) unit vertical in twelve (12) units horizontal,", "or 4.50? IBC 1613.6",
"From inside attic as viewed from the attic access point, are there exposed lag screws or lag screws that missed rafters? Are there split rafters due to lag", "screws?",
"From inside the attic, is there any sign of existing water damage?",
"From inside the attic, is there any sign of existing structural damage?",
"Should an additional structural evaluation be conducted based on a limited visual inspection?",
"Comments",
"Are signs and labels are of sufficient durability to withstand the environment involved and permanently installed? NEC 110.21(A)",
"System information that is not subject to change is conveyed permanently and not handwritten? NEC 110.21(B)",
"Are all exposed raceways, cable trays, enclosures, pull boxes and junction boxes properly labeled? NEC 690.31(G)(3), NEC 690.31(G)(4)",
"Is the required label installed at any inverter, junction box, combiner box, disconnecting means and device where energized, ungrounded circuits may be, exposed" "during service? NEC 690.35(F)",
"Are all disconnecting means permanently identified as a PV system disconnect? NEC 110.22(A), 690.13(B)",
"Is there a label on the DC disconnect warning of potential live terminals even when in the open position? NEC 690.17(E)",
"Is there a permanent label on the DC disconnecting means identifying the rated maximum power-point current, rated maximum power-point voltage, maximum system", "voltage, maximum circuit current, and maximum rated maximum output current of the charge controller (if installed)? NEC 690.53",
"Is there a label installed near the ground fault indicator or otherwise on the inverter identifying “Electrical Shock Hazard” if a ground fault is identified?", "NEC 690.5(C)",
"Are all interactive system points of interconnection with other sources marked at an accessible disconnecting means as a power source, and identifying the", "rated AC output current and the nominal operating AC voltage? NEC 690.54",
"Facilities with both utility services and PV systems have a permanent plaque or directory providing the locations of the service disconnecting means and the, PV" "system disconnecting means if they are not at the same location? NEC 690.56(B)",
"Facilities with both utility service and PV systems, complying with NEC 690.12, have a permanent plaque or directory identifying the system is “Equipped with", "Rapid Shutdown”? NEC 690.56(C), 690.31(G)(4)",
"Where both a utility and inverter are feeding a busbar at opposite ends of the load circuits, a permanent label is installed identifying “Inverter Output", "Connection, Do Not Relocate This Overcurrent Device”? NEC 705.12 (D)(2)(3)(b)",
"Equipment containing overcurrent devices in circuits supplying power to a busbar or a conductor supplied from multiple power sources is marked to indicate the", "presence of all sources? NEC 705.12(D)(3)",
"Comments",
"Site & Safety",
"Point of Interconnection",
"Inverter",
"Modules",
"Electrical",
"Structural / Mechanical",
"Labeling",
"Overall"]